<template>
  <div class="app">
    <Header />
    <Sprite />
    <p class="text">Разделение текста на абзацы призвано решать три важные задачи. Во-первых, автору гораздо легче с их помощью выстроить повествование, организовать доносимые до читателей мысли и идеи. Во-вторых, абзацы дают возможность остановиться и обдумать прочитанное, отвлечься, отдохнуть. И в-третьих, наличие абзацев служит для своеобразной быстрой навигации по «контрольным» точкам, как по микроглавам. Сегодня это особенно важно, поскольку поглощение огромного количества информации в сети отучило нас от вдумчивого чтения. Мы пробегаем текст глазами, перескакиваем к разным частям, стараясь побыстрее ухватить суть.</p>
  </div>
</template>

<script>

import Header from "./components/Header";
import Sprite from "./svg/sprite";
export default {
  name: 'App',
  components: {
    Sprite,
    Header
  }
}
</script>

<style>
* {
  box-sizing: border-box;
}
body {
  background: #f5f5f5;
}
.text {
  width: 200px;
  margin: 30px auto 0;
}
</style>
